taskt/Core/Automation/Commands/ExcelGroup/IExcelColumnRangeSetProperties.dot
digraph "taskt.Core.Automation.Commands.IExcelColumnRangeSetProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.IExcelColumnRangeSetProperties" [ label="IExcelColumnRangeSetProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelColumnRangeProperties" [ label="IExcelColumnRangeProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelRangeSetProperties" [ label="IExcelRangeSetProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelRCRangeProperties" [ label="IExcelRCRangeProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelInstanceProperties" [ label="IExcelInstanceProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelRCValueTypeProperties" [ label="IExcelRCValueTypeProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelValueTypeProperties" [ label="IExcelValueTypeProperties", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.IExcelColumnRangeSetProperties" -> "taskt.Core.Automation.Commands.IExcelColumnRangeProperties";
"taskt.Core.Automation.Commands.IExcelColumnRangeSetProperties" -> "taskt.Core.Automation.Commands.IExcelRangeSetProperties";
"taskt.Core.Automation.Commands.IExcelColumnRangeProperties" -> "taskt.Core.Automation.Commands.IExcelRCRangeProperties";
"taskt.Core.Automation.Commands.IExcelRangeSetProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
"taskt.Core.Automation.Commands.IExcelRCRangeProperties" -> "taskt.Core.Automation.Commands.IExcelInstanceProperties";
"taskt.Core.Automation.Commands.IExcelRCRangeProperties" -> "taskt.Core.Automation.Commands.IExcelRCValueTypeProperties";
"taskt.Core.Automation.Commands.IExcelInstanceProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
"taskt.Core.Automation.Commands.IExcelRCValueTypeProperties" -> "taskt.Core.Automation.Commands.IExcelValueTypeProperties";
"taskt.Core.Automation.Commands.IExcelValueTypeProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
}
